#ifndef _main_h_
#define _main_h_
/*======================================================================================================================================*/
/*                                                       Аппаратные особенности.                                                        */
/*======================================================================================================================================*/
//Определение выводов порта A:
#define IN0          PINA0                 //вывод приёма данных 0                        IN  (^)
#define IN1          PINA1                 //вывод приёма данных 1                        IN  (^)
#define IN2          PINA2                 //вывод приёма данных 2                        IN  (^)
#define IN3          PINA3                 //вывод приёма данных 3                        IN  (^)
#define IN4          PINA4                 //вывод приёма данных 4                        IN  (^)
#define IN5          PINA5                 //вывод приёма данных 5                        IN  (^)
#define IN6          PINA6                 //вывод приёма данных 6                        IN  (^)
#define IN7          PINA7                 //вывод приёма данных 7                        IN  (^)

//Определение выводов порта В:
#define IN8          PINB0                 //вывод приёма данных 8                        IN  (^)
#define IN9          PINB1                 //вывод приёма данных 9                        IN  (^)
#define IN10         PINB2                 //вывод приёма данных 10                       IN  (^)
#define IN11         PINB3                 //вывод приёма данных 11                       IN  (^)
#define SS           PORTB4                //вывод управления запуском "ведомого" SPI     OUT (1)
#define MOSI         PORTB5                //вывод передачи данных "ведущим" по SPI       OUT (1)
#define MISO         PINB6                 //вывод приема данных "ведущим" по SPI         IN  (^)
#define SCK          PORTB7                //вывод тактового сигнала от "ведущего" SPI    OUT (0)

#define SS_SET       PORTB |=  (1<<SS)
#define SS_RES       PORTB &= ~(1<<SS)

//Определение выводов порта C:
#define IN12         PINC0                 //вывод приёма данных 12                       IN  (^)
#define IN13         PINC1                 //вывод приёма данных 13                       IN  (^)
#define IN14         PINC2                 //вывод приёма данных 14                       IN  (^)
#define IN15         PINC3                 //вывод приёма данных 15                       IN  (^)
#define IN16         PINC4                 //вывод приёма данных 16                       IN  (^)
#define IN17         PINC5                 //вывод приёма данных 17                       IN  (^)
#define IN18         PINC6                 //вывод приёма данных 18                       IN  (^)
#define IN19         PINC7                 //вывод приёма данных 19                       IN  (^)

//Определение выводов порта D:
#define RX           PIND0                 //вывод приёма данных контроллером по RS-485   IN  (^)
#define TX           PORTD1                //вывод передачи данных контроллером по RS-485 OUT (1)
#define DE           PORTD2                //разрешение драйвера RS-485                   OUT (1)
/*======================================================================================================================================*/
/*                                                            Макроопределения.                                                         */
/*======================================================================================================================================*/
#define SETBIT(reg, bit)   reg |= (1<<bit)
#define CLEARBIT(reg, bit) reg &= (~(1<<bit))
#define INVBIT(reg, bit)   reg ^= (1<<bit)
/*======================================================================================================================================*/
/*                                                          Глобальные переменные.                                                      */
/*======================================================================================================================================*/
unsigned char byte_from_modbus1;
unsigned char byte_from_modbus2;
unsigned char byte_from_modbus3;
unsigned char byte_from_modbus4;
unsigned char byte_to_modbus1;
unsigned char byte_to_modbus2;
unsigned char byte_to_modbus3;
/*======================================================================================================================================*/
/*                                                                Прототипы.                                                            */
/*======================================================================================================================================*/
void SPI_MasterInit(void);
void SPI_Write(unsigned char dataout);

#endif
/*
Пометки:
1. Регистры портов в/в. Разряд DDxn регистра DDx определяет направление передачи данных через контакт ввода/вывода. Если этот разряд установлен в «1», то n-й вывод
порта является выходом, если же сброшен в «0» — входом. Разряд PORTxn регистра PORTx выполняет двойную функцию. Если вывод функционирует как выход (DDxn = «1»), 
этот разряд определяет состояние вывода порта. Если разряд установлен в «1», на выводе устанавливается напряжение ВЫСОКОГО уровня. Если разряд сброшен в «0», на 
выводе устанавливается напряжение НИЗКОГО уровня. Если же вывод функционирует как вход (DDxn = «0»), разряд PORTxn определяет состояние внутреннего подтягивающего 
резистора для данного вывода. При установке разряда PORTxn в «1» подтягивающий резистор подключается между выводом микроконтроллера и проводом питания. Состояние 
вывода микроконтроллера (независимо от установок разряда DDxn) может быть получено путем чтения разряда PINxn регистра PINx.
*/
