/*======================================================================================================================================*/
/*                                              Устройство преобразования ДИАФ.656111.059.                                              */
/*                                           Управляющая программа для ATmega8535 SPI Master.                                           */
/*======================================================================================================================================*/
#include <compat/ina90.h>   // _WDR();
#include <avr/iom8535.h>        
#include <avr/interrupt.h>  //_SEI(); _CLI();

#include "main.h"

/*======================================================================================================================================*/
/*                                                       Главная функция программы.                                                     */
/*======================================================================================================================================*/
int main( void )
{
  DDRA  = 0x0;
  PORTA = 0xff;

  DDRB  = (1<<SS)|(1<<SCK)|(1<<MOSI);
  PORTB = (1<<SCK)|(1<<MOSI)|(1<<MISO);

  DDRC  = 0x0;
  PORTC = 0xff;

  DDRD  = (1<<TX)|(1<<DE);
  PORTD = (1<<RX)|(1<<TX)|(1<<DE);

  _WDR();

  _SEI();                         //разрешение прерываний

  SPI_MasterInit();               //инициализация SPI в режиме Master

  byte_to_modbus1 = 0;
  byte_to_modbus2 = 0;
  byte_to_modbus3 = 0;

  for(;;)
  {
    SS_RES;
	   
    SPI_Write(byte_from_modbus1); //передача данных ведомому, полученных по шине ModBus 
	SPI_Write(byte_from_modbus2);
	SPI_Write(byte_from_modbus3);
	SPI_Write(byte_from_modbus4);

	SS_SET;

    byte_to_modbus1 |= PORTA;     //3 байта с 20 входов для передачи по шине ModBus
	byte_to_modbus2 |= PORTB;
	byte_to_modbus3 |= PORTC;
  }
  return(0);
}

// Подпрограмма инициализации SPI в режиме Master
void SPI_MasterInit(void)
{
/* 
  - Разрешение SPI в режиме ведущего,
  - CPOL = 1 - генерируются тактовые импульсы отрицательной полярности,
  - CPHA = 1 - — обработка данных производится по заднему фронту импульсов сигнала SCK,
  - установка скорости обмена fck/128 
*/
  SPCR = (1<<SPE)|(1<<MSTR)|(1<<CPOL)|(1<<CPHA)|(1<<SPR1)|(1<<SPR0);
}

// Подпрограмма записи через SPI
void SPI_Write(unsigned char dataout)
{
  // Запись байта в регист данных ведущего (инициализация передачи)
  SPDR = dataout;
  // Ожидание завершения передачи (пока бит SPIF не установлен)
  while(!(SPSR & (1<<SPIF)));
}
